app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("couse_number", "title", "description", "instructor", "status", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "title" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["title", "517"], ["updated_at", "2016-02-17 18:45:30.803149"], ["id", 2]]