app/controllers/students_controller.rb

  def show
    student_id = params[:id]
    @student = Student.find(student_id)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]

  def login
    @student = Student.where(email: params[:student][:email]).first
---
SELECT  "students".* FROM "students" WHERE "students"."email" = ?  ORDER BY "students"."id" ASC LIMIT 1  [["email", "11@11.com"]]